Revit 2027 API
BuiltInFailures.PathFailures Class
 Failures about Path.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.PathFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PathFailures
Public NotInheritable Class PathFailures
public ref class PathFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PathFailures = class end
The BuiltInFailures.PathFailures type exposes the following members.
Properties
Name | Description
Path3dRegenError |  Picked Path could not be regenerated.
Top
See Also
Reference
Autodesk.Revit.DB Namespace